Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicSymbolAttributes.Shape Property
 The shape of the mark symbol.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MarkSymbolShape Shape { get; set; }
Public Property Shape As MarkSymbolShape
	Get
	Set
Property Value
Type: MarkSymbolShape
See Also
Reference
ViewMarkBasicSymbolAttributes Class
Tekla.Structures.Drawing Namespace